# 刘付杰第三周总结
本周学习计划是 Linux c一书第8章线程相关知识,虽然书上本章节的内容相比前两章少了很多,
但是事实上由于线程相关知识确实比较抽象,难以理解,因此在学习完书上的知识点后,确实花费了
不少时间去查有关线程的一些资料,并且和别人进行讨论,以求对相关的知识点能够有更深刻的理解.
***
将关于线程的知识进行完成后,看到很多小伙伴已经开始学习网络编程一章了,但是自己的鸟哥那本书
进度还没有跟上,于是又用了一天多点时间学习了鸟哥第8章,接着也开始看了网络编程的开始部分,
果不其然,网络编程部分的知识更加的抽象,才刚刚开始看就感觉有点吃力,主要原因可能是没有网络
相关的知识做铺垫,接下来的一周的主要精力肯定是放在网络编程一章,这一章节不论是知识点的广度
还是深度,都比前面的章节提升很多,在与之前同样的时间里,如何能将更重的学习任务完成,这可能
需要比之前更合理的调整学习方法,遇到问题多和别人讨论,而不是自己埋头去查,去试,通过别人的
经验来获得知识确实是我目前的学习方法上面比较欠缺的一点.
***
对于最后的聊天室项目也思考过一点,自从攀哥讲座讲了数据库,看起来大家已经达成共识,都把数据库
用起来?看样子数据库这一关当下也是必须得过的了.界面上由于没学过图形开发,现阶段貌似只能寄生
在终端之下做文字界面了...
